## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.update_site_api_key_secret will be created
  + resource "github_actions_secret" "update_site_api_key_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "automatic-deployment-workflow"
      + secret_name     = "production_api_key"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>